app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "isadmin", "email", "created_at") VALUES('2009-08-28 17:45:51.034966', E'2c14cb419e528a92a4f50a12bac3b18fd8352f4e9b6d2c4d9f00ab5cc3d9248c0be544ae8e5f18682a868a17b3fbfc971659c641da486dc4f5bc1bcd68319acd', E'pavel', E'DfocSeZUlbosO2MNUpUk', E'a30f67b6fabd66ecf76c20bee024b3e6997381bec31882e8036312d4beade02934db7bb65d1e3997c80f2b48d2c9f48d8689dae02e41761d19d57fc5015f0fe9', NULL, E'pavel.v.zaitsev@gmail.com', '2009-08-28 17:45:51.034966') RETURNING "id"
---
  def create
    logger.warn params.to_yaml
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
---
  def show

    if params[:id] == 'current'
      @user = current_user
    else
      @user = User.find(params[:id])